Tekla Open API Reference for Tekla Structures 2025
MergedMarkPropertyElementTypes Methods
The PropertyElement.PropertyElementType.MergedMarkPropertyElementTypes type exposes the following members.
Methods
Name | Description
BlockPrefix
Returns the block prefix property element type.
DistancesBetweenGroups
Returns the distances between groups property element type.
SingleMarkContent
Returns the single mark content property element type.
SymbolSeparatingBlocksInMarks
Returns the symbol separating blocks in marks property element type.
Top
See Also
Reference
PropertyElement.PropertyElementType.MergedMarkPropertyElementTypes Class
Tekla.Structures.Drawing Namespace